Tekla Open API Reference for Tekla Structures 2025
OBB.ShortestSegmentTo Method (Point)
 Calculates the shortest LineSegment from OBB to the given point.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public LineSegment ShortestSegmentTo(
	Point point
)
Public Function ShortestSegmentTo (
	point As Point
) As LineSegment
Parameters
point
Type: Tekla.Structures.Geometry3d.Point
Point to calculate against.
Return Value
Type: LineSegment
Shortest LineSegment from OBB to the given point.
Exceptions
Exception | Condition
ArgumentNullException | Thrown when null is assigned to the point parameter.
See Also
Reference
OBB Class
ShortestSegmentTo Overload
Tekla.Structures.Geometry3d Namespace